<a href="https://colab.research.google.com/github/LambdaTheda/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/Copy_of_Black_Friday.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [10]:
# Imports
import pandas as pd
# Reading in csv
black_friday_csv_link = "https://raw.githubusercontent.com/pierretd/datasets-1/master/BlackFriday.csv"
bf = pd.read_csv(black_friday_csv_link)
bf.head()

   User_ID Product_ID Gender  ... Product_Category_2  Product_Category_3 Purchase
0  1000001  P00069042      F  ...                NaN                 NaN     8370
1  1000001  P00248942      F  ...                6.0                14.0    15200
2  1000001  P00087842      F  ...                NaN                 NaN     1422
3  1000001  P00085442      F  ...               14.0                 NaN     1057
4  1000002  P00285442      M  ...                NaN                 NaN     7969

[5 rows x 12 columns]

In [11]:
bf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 537577 entries, 0 to 537576
Data columns (total 12 columns):
User_ID                       537577 non-null int64
Product_ID                    537577 non-null object
Gender                        537577 non-null object
Age                           537577 non-null object
Occupation                    537577 non-null int64
City_Category                 537577 non-null object
Stay_In_Current_City_Years    537577 non-null object
Marital_Status                537577 non-null int64
Product_Category_1            537577 non-null int64
Product_Category_2            370591 non-null float64
Product_Category_3            164278 non-null float64
Purchase                      537577 non-null int64
dtypes: float64(2), int64(5), object(5)
memory usage: 49.2+ MB

### Run the cells above  to load the dataset, then answer the following questions.


#### 1) Clean the data set and drop the Null/NaN values.

In [12]:
bf.dropna()

bf.describe()

            User_ID    Occupation  ...  Product_Category_3       Purchase
count  5.375770e+05  537577.00000  ...       164278.000000  537577.000000
mean   1.002992e+06       8.08271  ...           12.669840    9333.859853
std    1.714393e+03       6.52412  ...            4.124341    4981.022133
min    1.000001e+06       0.00000  ...            3.000000     185.000000
25%    1.001495e+06       2.00000  ...            9.000000    5866.000000
50%    1.003031e+06       7.00000  ...           14.000000    8062.000000
75%    1.004417e+06      14.00000  ...           16.000000   12073.000000
max    1.006040e+06      20.00000  ...           18.000000   23961.000000

[8 rows x 7 columns]

#### 2) How many unique user_ids does the data set contain?

In [16]:
len(bf['User_ID'].unique()) # answer: length of array is # of unique id #s

5891

#### 3) How many unique age brackets are in the dataset. Which Age bracket has the most entries? Which has the least?

In [19]:
len(bf['Age'].unique())

bf['Age'].value_counts()

26-35    214690
36-45    107499
18-25     97634
46-50     44526
51-55     37618
55+       20903
0-17      14707
Name: Age, dtype: int64

#### 4) What is the average Occupation score? What is the Standard Deviation? What is the maximum and minimum value?

In [20]:
bf['Occupation'].describe()

count    537577.00000
mean          8.08271
std           6.52412
min           0.00000
25%           2.00000
50%           7.00000
75%          14.00000
max          20.00000
Name: Occupation, dtype: float64

#### 5) Group Age by Gender and print out a cross tab with age as the y axis

In [25]:
bf.groupby('Gender')

'''
By default computes a frequency table of the factors unless an array of values and an aggregation function are passed.”

This compares the index and column to get the count.
pd.crosstab(index=df['Car'], columns=df['Color'])
'''
pd.crosstab(index=bf['Gender'], columns=bf['Age'])

Age     0-17  18-25   26-35  36-45  46-50  51-55    55+
Gender
F       4953  24057   49348  26420  12856   9634   4929
M       9754  73577  165342  81079  31670  27984  15974